---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.ShowContourLines
source: html/2bab272e-0ee5-abee-8b5b-2a95234fce3c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.ShowContourLines Property

If true, show contour lines in the analysis display.

## Syntax (C#)
```csharp
public bool ShowContourLines { get; set; }
```